---
kind: type
id: T:Autodesk.Revit.DB.Events.ExternalDataInstanceAddingIntoDocumentEventArgs
source: html/8601a344-dd92-b78f-6298-e1a6f5355a77.htm
---
# Autodesk.Revit.DB.Events.ExternalDataInstanceAddingIntoDocumentEventArgs

The event arguments used by the ExternalDataInstanceAddingInto event.

## Syntax (C#)
```csharp
public class ExternalDataInstanceAddingIntoDocumentEventArgs : RevitAPIPreDocEventArgs
```